from aiogram.utils.formatting import Bold, as_list, as_marked_section


categories = ['Еда 🍖', 'Напитки 🍹']

description_for_info_pages = {
    "main": "Добро пожаловать!",
    "about": "Мясной магазин. \nГуляй рука, балдей живот.\nРежим работы - круглосуточно.",
    "payment": as_marked_section(
        Bold("Варианты оплаты:"),
        "Картой в боте",
        "При получении карта/кеш",
        "В заведении",
        marker="✅ ",
    ).as_html(),
    "shipping": as_list(
        as_marked_section(
            Bold("Варианты доставки/заказа:"),
            "Конями",
            "Самовывоз (сейчас прибегу, молодым кабанчиком, заберу)",
            "(сейчас прибегу) Пожру у Вас",
            marker="✅ ",
        ),
        as_marked_section(Bold("Нельзя:"), "Почта", "Голуби", marker="❌ "),
        sep="\n----------------------\n",
    ).as_html(),
    'catalog': 'Категории:',
    'cart': 'Ваша корзина пуста!'
}
